

export const locale = {
  months: [
    ["Январь", "Янв"],
    ["Февраль", "Фев"],
    ["Март", "Мар"],
    ["Апрель", "Апр"],
    ["Май", "Май"],
    ["Июнь", "Июн"],
    ["Июль", "Июл"],
    ["Август", "Авг"],
    ["Сентябрь", "Сен"],
    ["Октябрь", "Окт"],
    ["Ноябрь", "Ноя"],
    ["Декабрь", "Дек"],
  ],
  weekDays: [
    ["Суббота", "Сб"],

    ["Воскресенье", "Вс"],

    ["Понеделник", "Пн"],
    ["Вторник", "Вт"],
    ["Среда", "Ср"],
    ["Четверг", "Чт"],
    ["Пятница", "Пт"],
  ],
  digits: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
  meridiems: [
    ["ก่อนเที่ยง", "เอเอ็ม"],
    ["หลังเที่ยง", "พีเอ็ม"],
  ],
}

export const localeuz = {
  months: [
    ["Yanvar", "Yan"],
    ["Fevral", "Fev"],
    ["Mart", "Маrt"],
    ["Aprel", "Apr"],
    ["May", "May"],
    ["Iyun", "Iyun"],
    ["Iyul", "Iyul"],
    ["Avgust", "Avg"],
    ["Sentabr", "Sen"],
    ["Oktabr", "Okt"],
    ["Noyabr", "Noy"],
    ["Dekabr", "Dek"],
  ],
  weekDays: [
    ["Shanba", "Shan"],
    ["Yakshanba", "Yak"],

    ["Dushanba", "Dush"],
    ["Seshanba", "Sesh"],
    ["Chorshanba", "Chor"],
    ["Payshanba", "Pay"],
    ["Juma", "Jum"],
  ],
  digits: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
  meridiems: [
    ["ก่อนเที่ยง", "เอเอ็ม"],
    ["หลังเที่ยง", "พีเอ็ม"],
  ],
} as any


